In [2]:
import numpy as np
import pandas as pd

In [5]:
df2=pd.DataFrame(np.random.rand(15).reshape(5,3), columns=['col1','col2','col3'], index=['a','b','c','d','e'])
df2['col4']= np.arange(5)

In [6]:
df2

       col1      col2      col3  col4
a  0.994700  0.374323  0.830171     0
b  0.650780  0.924054  0.834534     1
c  0.825124  0.198440  0.024221     2
d  0.931559  0.076659  0.382428     3
e  0.652708  0.995672  0.572294     4

In [7]:
df2['col5']= df2['col1'] + df2['col3']
df2

       col1      col2      col3  col4      col5
a  0.994700  0.374323  0.830171     0  1.824871
b  0.650780  0.924054  0.834534     1  1.485314
c  0.825124  0.198440  0.024221     2  0.849345
d  0.931559  0.076659  0.382428     3  1.313987
e  0.652708  0.995672  0.572294     4  1.225002

In [9]:
# drop
df2.drop('col5', axis=1)

       col1      col2      col3  col4
a  0.994700  0.374323  0.830171     0
b  0.650780  0.924054  0.834534     1
c  0.825124  0.198440  0.024221     2
d  0.931559  0.076659  0.382428     3
e  0.652708  0.995672  0.572294     4

In [10]:
df2

       col1      col2      col3  col4      col5
a  0.994700  0.374323  0.830171     0  1.824871
b  0.650780  0.924054  0.834534     1  1.485314
c  0.825124  0.198440  0.024221     2  0.849345
d  0.931559  0.076659  0.382428     3  1.313987
e  0.652708  0.995672  0.572294     4  1.225002

In [11]:
df2.drop('col5', axis=1, inplace=True)

In [12]:
df2

       col1      col2      col3  col4
a  0.994700  0.374323  0.830171     0
b  0.650780  0.924054  0.834534     1
c  0.825124  0.198440  0.024221     2
d  0.931559  0.076659  0.382428     3
e  0.652708  0.995672  0.572294     4

In [13]:
# drooping a row
df2.drop('e')

       col1      col2      col3  col4
a  0.994700  0.374323  0.830171     0
b  0.650780  0.924054  0.834534     1
c  0.825124  0.198440  0.024221     2
d  0.931559  0.076659  0.382428     3

In [14]:
# drop rows based on conditions
df2.drop(df2[df2['col4'] > 3].index)

       col1      col2      col3  col4
a  0.994700  0.374323  0.830171     0
b  0.650780  0.924054  0.834534     1
c  0.825124  0.198440  0.024221     2
d  0.931559  0.076659  0.382428     3

In [20]:
df2[df2['col4']>3].index

Index(['e'], dtype='object')

In [15]:
df2.drop(df2[(df2['col4']>3) | (df2['col1']<0.9)].index)

       col1      col2      col3  col4
a  0.994700  0.374323  0.830171     0
d  0.931559  0.076659  0.382428     3

## Multi-Index

In [21]:
outer=['Task1','Task1','Task2','Task2']
inner=['Ram','Lucky','Ram','Lucky']
multiIndex= pd.MultiIndex.from_tuples(list(zip(outer, inner)))
multiIndex

MultiIndex(levels=[['Task1', 'Task2'], ['Lucky', 'Ram']],
           labels=[[0, 0, 1, 1], [1, 0, 1, 0]])

In [22]:
df3= pd.DataFrame(np.random.rand(4,2), index=multiIndex, columns=['level1','level2'])
df3

               level1    level2
Task1 Ram    0.176130  0.080082
      Lucky  0.102994  0.235086
Task2 Ram    0.846569  0.390396
      Lucky  0.464271  0.384739

In [23]:
df3.loc['Task1']

         level1    level2
Ram    0.176130  0.080082
Lucky  0.102994  0.235086

In [24]:
df3.loc['Task1'].loc['Lucky']

level1    0.102994
level2    0.235086
Name: Lucky, dtype: float64

In [25]:
df3.loc['Task1','level2']

Ram      0.080082
Lucky    0.235086
Name: level2, dtype: float64

In [26]:
df3.loc[['Task1','Task2'], 'level2']

Task1  Ram      0.080082
       Lucky    0.235086
Task2  Ram      0.390396
       Lucky    0.384739
Name: level2, dtype: float64

In [27]:
df3.loc[('Task1','Ram')]

level1    0.176130
level2    0.080082
Name: (Task1, Ram), dtype: float64

In [28]:
df3.loc[('Task1','Ram'),'level1']

0.1761304116915441

In [29]:
df3.loc[[('Task1','Ram'), ('Task2','Lucky')],'level2']

Task1  Ram      0.080082
Task2  Lucky    0.384739
Name: level2, dtype: float64